package com.ziwookim.random_nickname_maker;

import lombok.AccessLevel;
import lombok.Getter;
import lombok.NoArgsConstructor;

import java.util.List;

@NoArgsConstructor(access = AccessLevel.PRIVATE)
@Getter
public class RandomNickNameMaker {

    // 품사, 글자수, 값
    // adverb array's length is 29
    // adverb array's the shortest value's length is 2
    // adverb array's the longest value's length is 5
//    private final static String[] ADVERB = {"자주", "항상", "가끔", "금방", "쉽게", "천천히", "직접", "조용히", "빠르게", "슬며시", "갑자기", "아마", "정말", "다정히", "소중히", "편안히", "밝게", "온전히", "깔끔히", "간편히", "효과적으로", "부드럽게", "깊이", "강하게", "조심스럽게", "차분히", "순조롭게", "나름대로", "신중히"};

    // adjective array's length is 16
    // adjective array's the shortest value's length is 2
    // adjective array's the longest value's length is 6
//    private final static String[] ADJECTIVE = {"건강한", "안전한", "깨끗한", "밝은", "좋은", "행복한", "맛있는", "기쁨을 주는", "친절한", "사랑스러운", "상쾌한", "즐거운", "조용한", "평화로운", "소중한", "넓은"};

    // noun arrays' length is 614
    // noun array's the shortest value's length is 1
    // noun array's the longest value's length is 5
//    private final static String[] NOUN = {"가방", "가족", "감정", "강아지", "감사", "개미", "고래", "공원", "꿈", "기분", "기념일", "그림", "길", "고슴도치", "고양이", "구름", "꽃", "갯벌", "감자", "금요일", "구슬", "귀여움", "과일", "그늘", "감성", "계획", "가격", "가위", "고백", "고향", "골프", "기차", "기적", "고백자", "곰", "공기", "갈매기", "고개", "곡식", "권리", "개선", "갈대", "균형", "교훈", "간식", "급식", "관찰", "고모", "고구마", "나무", "나비", "날씨", "농장", "놀이", "눈빛", "뉴스", "느낌", "넓이", "노래", "노을", "나침반", "낙엽", "나절", "날개", "너비", "논리", "녹음", "나이", "나라", "낚시", "노력", "네트워크", "농부", "노트", "내기", "냉장고", "내일", "노선", "낙찰", "낙엽", "나뭇잎", "나비효과", "농첩", "녹차", "논문", "느림보", "냄비", "낙관", "누리", "뉴스레터", "내과", "낭만", "농촌", "냉동", "나머지", "넓은", "노릇", "다리", "단추", "도서관", "도전", "동물", "드라마", "디자인", "대화", "대중", "다양한", "도시", "다람쥐", "담임", "단체", "대지", "동기", "동행", "동화", "덩이", "대장", "대회", "도로", "당근", "달력", "돌잔치", "다과", "단면", "대리", "드라이브", "대사", "득점", "돼지", "도장", "담배", "도미노", "독서", "다짐", "다이빙", "동물원", "대문", "동네", "대칭", "드릴", "달콤함", "담배연기", "대가", "담임교사", "대형", "다이어트", "달팽이", "라디오", "레몬", "리본", "리더", "로봇", "리프레시", "러닝", "랜드마크", "루비", "라이브", "롤러코스터", "립스틱", "레터링", "리더십", "러브", "렌즈", "리듬", "리스", "리미트", "리프트", "리셋", "로션", "롤링", "라일락", "레벨", "랭크", "로얄", "리얼", "루틴", "로지", "마을", "나무", "마음", "무지개", "미소", "목표", "미술", "맛", "모양", "무게", "멜로디", "모험", "명절", "목소리", "미소", "메시지", "마법", "마스크", "먼지", "묘기", "문제", "문화", "맞춤법", "미세", "문서", "모델", "마련", "맑음", "마카롱", "맛집", "마음가짐", "만남", "명함", "미생물", "마음대로", "민들레", "매운맛", "메모리", "미세먼지", "멋", "만화", "멸종", "마라톤", "물체", "무선", "방법", "배움", "마리", "문학", "바람", "바다", "별", "보물", "보살핌", "부엌", "브랜드", "방울", "배움", "방문", "백화점", "분수", "버튼", "비누", "비성", "부탁", "믿음", "바구니", "바위", "밭", "보호", "분리", "배경", "브로콜리", "방송", "바나나", "번역", "볼링", "방안", "비트", "반찬", "볶음밥", "분석", "범위", "바닥", "본질", "바탕", "봉사", "사랑", "사과", "상상", "스포츠", "신뢰", "시계", "손길", "소원", "솔직", "순수", "사전", "사람", "새벽", "샘물", "상처", "시나리오", "조회", "시설", "시장", "식사", "습관", "시도", "수업", "스승", "수확", "수록", "선수", "섬", "성과", "실내", "심지", "심리", "심장", "신기", "술잔", "수리", "수소", "수레", "수수께끼", "실패", "시각", "실험", "스트레스", "서양", "설정", "아침", "아름다움", "연구", "에너지", "옷장", "의미", "운동", "원예", "유아", "약속", "아이디어", "어린이", "얼음", "어머니", "의사", "엄마", "응원", "의자", "양식", "요리", "예술", "잔치", "여름", "연주", "유혹", "야구", "어린이집", "음악", "연결", "양말", "요구", "사업", "이웃", "이유", "이야말", "자전거", "장소", "장미", "장난감", "자유", "자식", "작업", "자격", "자원", "자세", "장점", "잔디", "자극", "조화", "좋은", "족보", "저울", "저녁", "정보", "조각", "주말", "지식", "지도", "지갑", "지붕", "집", "진실", "종이", "주스", "재료", "조리", "전통", "진달래", "진주", "자원봉사", "졸업", "조명", "정색", "정신", "줌", "조기", "제공", "지구", "진료", "증명서", "진실성", "진행", "주식", "좋은", "전시", "차", "창문", "친구", "축제", "추억", "채소", "계약", "청소", "처음", "칠판", "치즈", "차이", "치마", "치아", "차원", "찬물", "채널", "챔피언", "참깨", "채권", "출발", "침대", "착한", "차별", "초록", "체험", "찜질방", "칭찬", "창고", "청춘", "처방전", "청정", "차도", "친환경", "창작", "채택", "촉각", "초대", "청소년", "춤", "차넣기", "초코릿", "책상", "챙김", "축하", "초대장", "출처", "처소", "체계", "친구사이", "카메라", "커피", "칼", "키", "크기", "클럽", "컵", "캐릭터", "캔디", "카드", "캠퍼스", "쿡북", "크레딧", "체스", "그리고", "칠", "키스", "코스", "콘텐츠", "컴퓨터", "컷", "코코아", "캠페인", "크리켓", "커터", "커넥터", "코트", "캐치", "코인", "키보드", "크레딧", "컨셉", "키워드", "키트", "카페", "커플", "칩", "케이스", "컴퍼스", "카운터", "커넥션", "코드", "클라우드", "컷팅", "카운트", "클렌징", "코어", "커뮤널", "칼라", "컵케이크", "타인", "태양", "태도", "테이블", "탐험", "타올", "테스트", "통화", "타입", "팀", "틀", "트리", "튜브", "토끼", "통증", "틈새", "탕", "트레인", "탈출", "탄생", "틀림", "탈", "퇴원", "테크닉", "타이밍", "투표", "태풍", "타락", "통로", "트렌드", "텍스트", "통계", "통합", "숙제", "통제", "투명", "태도", "타이틀", "테마", "풀", "박물관", "태풍", "템플릿", "톡톡", "탑승", "타운", "턱", "한도", "탑", "트리거", "파도", "편안함", "포도", "풍선", "평화", "플라스틱", "패턴", "폭포", "편지", "평화롭다", "판다", "프로그램", "팔찌", "필름", "피아노", "펜", "패키지", "포켓", "피자", "플라워", "픽셸", "프로젝트", "판마다", "평가", "편지지", "평면", "퍼즐", "페이지", "핸드백", "포지션", "패스", "파트너", "페이지", "하늘", "행복", "하루", "흔들림", "후기", "허락", "흥미", "해바라기", "호수", "황금", "흰색", "한강", "향기", "횡단보도", "하수", "희망", "화분", "향신료", "호박", "햇살", "호감", "현미경", "해변", "화면", "호흡", "헌신", "활동", "한심", "행복감", "활기", "화장", "헬스", "한정", "혼자", "항구", "힐링", "화요일"};

    private final static boolean DEFAULT_IS_INCLUDE_BLANK = true;
    private final static Integer DEFAULT_MAX_LENGTH = 19;
    private final static NumberOfPhrase DEFAULT_NUMBER_OF_PHRASE = NumberOfPhrase.PHRASE_2;

    private boolean isIncludedBlank = DEFAULT_IS_INCLUDE_BLANK;
    private NumberOfPhrase numberOfPhrase = DEFAULT_NUMBER_OF_PHRASE;
    private Integer maxLength = DEFAULT_MAX_LENGTH;

    public static RandomNickNameMaker builder() {
        return new RandomNickNameMaker();
    }

    public RandomNickNameMaker maxLength(int  maxLength) {
        this.maxLength = maxLength;
        return this;
    }

    public RandomNickNameMaker numberOfPhrase(NumberOfPhrase numberOfPhrase) {
        this.numberOfPhrase = numberOfPhrase;
        return this;
    }

    public RandomNickNameMaker includeBlank(boolean isIncludedBlank) {
        this.isIncludedBlank = isIncludedBlank;
        return this;
    }

    public String getNickName() {
        return null;
//        return new NickNameGenerator(this);
    }
}
